Repository: 84000/data-translation-memory
Catalog: toh44-31_84000-the-ten-bhumis.tmx
Source language: bo
Languages: en

source: །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེའི་སྙིང་པོ་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་ལྷུན་དང་། རང་བཞིན་ཡང་དག་པར་སྟོན་པ་ལ་སྙོམས་པར་ཞུགས་མ་ཐག་ཏུ་དེ་ནས་དེ་ཉིད་ཀྱི་ཚེ། བྱང་ཆུབ་སེམས་དཔའི་འཁོར་དེ་དག་ཐམས་ཅད་དང་། ལྷ་དང་ཀླུ་དང་གནོད་སྦྱིན་དང་དྲི་ཟ་དང་ལྷ་མ་ཡིན་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་གྱི་མགོན་པོ་དང་། དབང་ཕྱུག་ཆེན་པོ་དང་། གཙང་མའི་གནས་ཀྱི་རིས་སུ་གཏོགས་པའི་འཁོར་དེ་དག་ཐམས་ཅད་བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེའི་སྙིང་པོའི་ལུས་ཀྱི་ནང་ན་འཁོད་པ་རང་རང་གིས་ཤེས་པར་གྱུར་ཏེ། དེར་སངས་རྒྱས་ཀྱི་ཞིང་མངོན་དུ་གྲུབ་པར་ཤེས་སོ།
en: As soon as the bodhisattva Vajra­garbha entered the bodhisattva samādhi called revealing the nature of the body of the buddha realms , the entire assembly of bodhisattvas and devas, nāgas, yakṣas, gandharvas, asuras, Śakra devas, Brahmā devas, lokapālas, Maheśvara devas, and Śuddhāvāsa devas perceived that they were inside the body of the bodhisattva Vajra­garbha, and they perceived there a fully formed buddha realm.

source: །སངས་རྒྱས་ཀྱི་ཞིང་དེའི་རྣམ་པ་དང་། རྒྱན་ཇི་སྙེད་པ་དེ་དག་ཀྱང་བསྐལ་པ་ཁྲག་ཁྲིག་ཚང་བས་ཀྱང་བརྗོད་པར་མི་ནུས་པར་མཐོང་སྟེ།
en: The display of forms in that buddha realm could not be easily described, even in a hundred thousand million eons.

source: དེར་བྱང་ཆུབ་ཀྱི་ཤིང་སྟོང་གསུམ་བརྒྱ་སྟོང་ཕྲག་བཅུར་ཁྱབ་པའི་ལྷུན་ཅན་སྟོང་གསུམ་ཁྲག་ཁྲིག་ཡོངས་སུ་ཚང་བ་ཙམ་དུ་ཡངས་ཤིང་། ཚད་མེད་པའི་ཡལ་ག་ཅན། རྩེ་མོ་ཤིན་ཏུ་མཐོ་བ་བྱུང་སྟེ། དེ་དང་རྐྱེན་དུ་འབབ་པར་དེའི་དྲུང་གི་སྙིང་པོ་བྱང་ཆུབ་ལ་སེང་གེའི་ཁྲི་རྒྱ་ཆེན་པོ་བྱུང་ནས་དེ་ལ་དེ་བཞིན་གཤེགས་པ་མངོན་པར་ཤེས་པའི་བློ་གྲོས་ཐམས་ཅད་ཀྱི་རྒྱལ་པོ་ཞེས་བྱ་བ་སྙིང་པོ་བྱང་ཆུབ་ཏུ་གཤེགས་ཏེ་བཞུགས་པར་མཐོང་ངོ་།
en: They saw a Bodhi tree with a trunk as wide as a million billion-world universes and branches at their highest point filling an immeasurable vastness of ten million billion-world universes, with a vast lion throne of corresponding size on the bodhimaṇḍa, on which was a tathāgata named Sarvābhijñā­mati­rāja, who comes to the bodhimaṇḍa and sits there.

source: །དེ་ལྟར་དེ་ན་རྒྱན་ཇི་སྙེད་སྣང་བར་གྱུར་པ་དེ་དག་ནི་བསྐལ་པ་ཁྲག་ཁྲིག་ཡོངས་སུ་ཚང་བས་ཀྱང་བརྗོད་པར་དཀའོ།
en: They thus saw a display that could not be easily described, even in ten million eons.

source: །དེས་ཆོ་འཕྲུལ་ཆེན་པོ་འདི་བསྟན་ནས་བྱང་ཆུབ་སེམས་པས་འཁོར་དེ་དག་ཐམས་ཅད་དང་། ལྷ་དང་ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། བརྒྱ་བྱིན་དང་ཚངས་པ་དང་འཇིག་རྟེན་གྱི་མགོན་པོ་དང་། དབང་ཕྱུག་ཆེན་པོ་དང་། གནས་གཙང་མའི་རིས་སུ་གཏོགས་པའི་འཁོར་དེ་དག་ཐམས་ཅད་སོ་སོའི་གནས་ཇི་བཞིན་དུ་བཀོད་པ་དང་། དེ་ནས་འཁོར་དེ་དག་ཐམས་ཅད་ངོ་མཚར་དང་རྨད་དུ་གྱུར་ནས།
en: He displayed this great miracle and then sent back to where they had been before that entire assembly of bodhisattvas and the devas, nāgas, yakṣas, gandharvas, asuras, Śakra devas, Brahmā devas, lokapālas, Maheśvara devas, and Śuddhāvāsa devas.

source: མི་སྨྲ་བར་བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེའི་སྙིང་པོ་དེ་ཉིད་ལ་སེམས་ཤིང་འཁོད་པར་གྱུར་ཏོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་གྲོལ་བའི་ཟླ་བས།
en: The entire assembly was astonished, and they remained silently focused on the bodhisattva Vajra­garbha.

source: བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེའི་སྙིང་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Then the bodhisattva Vimukti­candra said to the bodhisattva Vajra­garbha, “O jinaputra!

source: །ཀྱེ་རྒྱལ་བའི་སྲས་ཏིང་ངེ་འཛིན་འདིའི་མཐུ་རྣམ་པར་བཀོད་པ་དེ་ནི་རྨད་དུ་བྱུང་བར་ངོ་མཚར་ཆེ་ན།
en: The display of the power of this samādhi is inconceivable. It is astonishing. It is marvelous.

source: ཀྱེ་རྒྱལ་བའི་སྲས་ཏིང་ངེ་འཛིན་དེའི་མྱིང་ཅི་ཞེས་བྱ།
en: O jinaputra! What is the name of the samādhi?”

source: ཀྱེ་རྒྱལ་བའི་སྲས་ཏིང་ངེ་འཛིན་དེ་ནི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་ལྷུན་དང་རང་བཞིན་ཡང་དག་པར་སྟོན་པ་ཞེས་བྱའོ།
en: The samādhi is called revealing the nature of the body of the buddha realms

source: ཀྱེ་རྒྱལ་བའི་སྲས་འོ་ན་ཏིང་ངེ་འཛིན་འདིའི་སྤྱོད་ཡུལ་དང་། ཡུལ་དང་རྒྱན་ཇི་ལྟ་བུ་ཡིན།
en: Then what is the display of the range and scope of this samādhi?”

source: ཀྱེ་རྒྱལ་བའི་སྲས་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་འདི་ལ་ཤིན་ཏུ་གོམས་པ་ནི། འདོད་ན་སངས་རྒྱས་ཀྱི་ཞིང་འདི་འདྲ་བ་འཇིག་རྟེན་གྱི་ཁམས་ཆུ་ཀླུང་གང་གཱའི་བྱེ་མ་སྙེད་དམ། དེ་བས་ཀྱང་མང་དུ་རང་གི་ལུས་ལ་སྟོན་ཏོ།
en: The bodhisattva who has cultivated this samādhi, if he wishes to, displays within his body as many buddha realms as there are atoms in worlds to the number of the grains of sand in the Ganges River, and even more.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་བྱང་ཆུབ་སེམས་དཔའི་ས་ཆོས་ཀྱི་སྤྲིན་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔས་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་འདི་འདྲ་བ་བརྒྱ་སྟོང་ཤིན་ཏུ་མང་བ་རབ་ཏུ་འཐོབ་སྟེ།
en: O jinaputras! The bodhisattva on the bodhisattva bhūmi Cloud of Dharma attains many hundreds of thousands of bodhisattva samādhis like this.

source: དེ་བས་བྱང་ཆུབ་སེམས་དཔའ་དེའི་ལུས་སམ། ལུས་ཀྱི་ལས་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྒྱལ་ཚབ་ཀྱི་གོ་འཕང་ཐོབ་ཅིང་བྱང་ཆུབ་སེམས་པས་ས་ལེགས་པའི་བློ་གྲོས་ལ་གནས་པ་དག་གིས་ཀྱང་ཤེས་པར་སླ་བ་མ་ཡིན་ནོ།
en: Therefore, even bodhisattvas on the bhūmi Perfect Understanding, who have attained the state of crown princes, cannot easily know the body and physical actions of that bodhisattva.

source: །ངག་གམ་ངག་གི་ལས་ཀྱང་ཤེས་པར་སླ་བ་མ་ཡིན་ནོ།
en: They cannot easily know his speech and vocal activity.

source: །ཡིད་དམ་ཡིད་ཀྱི་ལས་ཀྱང་ཤེས་པར་སླ་བ་མ་ཡིན་ནོ།
en: They cannot easily know his mind and mental activity.

source: །རྫུ་འཕྲུལ་ཤེས་པར་སླ་བ་མ་ཡིན་ནོ། །དུས་གསུམ་ལ་རྣམ་པར་ལྟ་བ་ཤེས་པར་སླ་བ་མ་ཡིན་ནོ།
en: They cannot easily know his seeing the three times.

source: །ཏིང་ངེ་འཛིན་གྱི་སྤྱོད་ཡུལ་ལ་འཇུག་པ་ཤེས་པར་སླ་བ་མ་ཡིན་ནོ།
en: They cannot easily know the scope of his samādhi.

source: །ཡེ་ཤེས་ཀྱི་ཡུལ་ཤེས་པར་སླ་བ་མ་ཡིན་ནོ།
en: They cannot easily know the scope of his wisdom.

source: །རྣམ་པར་ཐར་པས་རྣམ་པར་རོལ་པ་ཤེས་པར་སླ་བ་མ་ཡིན་ནོ། །འཕྲུལ་པའི་ལས་ཤེས་པར་སླ་བ་མ་ཡིན་ནོ། །བྱིན་གྱི་རླབས་ཀྱི་ལས་ཤེས་པར་སླ་བ་མ་ཡིན་ནོ།
en: They cannot easily know his effortless enjoyment of liberation.

source: །མཐུའི་ལས་ཤེས་པར་སླ་བ་མ་ཡིན་པ་ནས་མདོར་བསྡུ་ན་གོམ་པ་འདོར་ཞིང་འདེགས་པའི་ལས་ཀྱི་བར་དུ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་རྒྱལ་ཚབ་ཀྱི་གོ་འཕང་ཐོབ་ཅིང་བྱང་ཆུབ་སེམས་དཔའི་ས་ལེགས་པའི་བློ་གྲོས་ལ་གནས་པ་རྣམས་ཀྱིས་ཀྱང་ཤེས་པར་སླ་བ་མ་ཡིན་ཏེ།
en: They cannot easily know his activity of emanation, his activity of control, or his activity of power, and they cannot even easily know the raising of his foot and the setting down of his foot.

source: ཀྱེ་རྒྱལ་བའི་སྲས་བྱང་ཆུབ་སེམས་དཔའི་ས་ཆོས་ཀྱི་སྤྲིན་འདི་ནི་མདོར་བསྡུས་ཏེ་བསྟན་ན་ཡང་དེ་ལྟར་ཚད་མེད་པ་སྟེ། རྒྱ་ཆེར་ནི་བསྐལ་པ་བརྒྱ་སྟོང་གྲངས་མེད་པས་ཀྱང་བསྟན་པའི་མཐར་ཐུག་པར་མི་འགྱུར་བར་ཤེས་པར་བྱའོ།
en: “O jinaputra! That is in brief the immeasurable bodhisattva bhūmi Cloud of Dharma, which if taught in detail could not be completed in countless hundreds of thousands of eons.”

source: ཀྱེ་རྒྱལ་བའི་སྲས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤྱོད་ཡུལ་དང་བྱིན་གྱིས་རླབས་ཀྱང་དེ་ལྟར་ཚད་མེད་ན་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་སྤྱོད་ཡུལ་དང་ཡུལ་གྱི་རྒྱུད་ཅི་འདྲ་བ་ཞིག་ཡོད།
en: If the scope of power and activity of the bodhisattvas is in that way immeasurable, what is the scope and range of activity of a tathāgata?”

source: བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེའི་སྙིང་པོས་སྨྲས་པ། ཀྱེ་རྒྱལ་བའི་སྲས་འདི་ལྟ་སྟེ་དཔེར་ན།
en: The bodhisattva Vajra­garbha answered, “O jinaputra!

source: མྱི་ལ་ལ་ཞིག་གིས་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་ནས་རྡེའུ་རྒྱ་ཤུག་གི་ཚིག་གུ་ཙམ་གཉིས་སམ་གསུམ་ཞིག་བླངས་ཏེ། འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་པ་དག་ན། སའི་ཁམས་ཇི་སྙེད་ཅིག་ཡོད་པ།
en: To give an analogy, it is like a person in a four-continent world who picks up two or three pebbles the size of jujubes and asks, ‘How large is the element of the earth in the endless worlds?

source: རྡོ་བ་འདི་ལས་ཇི་ཙམ་ཞིག་གིས་ལྷག་པར་འཕགས་ཤིང་ལྷག་པར་ཚད་མེད་ཅེས་ཟེར་བ་ཞིག་ཡོད་ན།
en: Is it greater than these pebbles or is it immeasurable?’

source: ཀྱེ་རྒྱལ་བའི་སྲས་དེ་ལྷར་ཁྱོད་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡེ་ཤེས་ཚད་མེད་པ་མངའ་བ་རྣམས་ཀྱི་ཆོས་ཉིད་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཉིད་ཀྱིས་འཇལ་བ་ནི་ཁྱོད་ཀྱི་ཚིག་འདི་དེ་དང་འདྲ་བར་བདག་གིས་དཔགས་སོ།
en: “O jinaputra! That is what your question to me is like. You are comparing the nature of bodhisattvas with the nature of the bhagavat arhat samyak­sambuddhas who have immeasurable wisdom. “O jinaputra!

source: །ཀྱེ་རྒྱལ་བའི་སྲས་ཇི་ལྟར་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་ནས་གང་བླངས་པའི་སའི་ཁམས་ཆུང་ཟད་ལ་ལྷག་མ་ལས་ཚད་མེད་པ་དེ་བཞིན་དུ། ཀྱེ་རྒྱལ་བའི་སྲས་བྱང་ཆུབ་སེམས་དཔའི་ས་ཆོས་ཀྱི་སྤྲིན་འདི་ཁོ་ན་ཡང་བསྐལ་པ་གྲངས་མེད་པར་ཤིན་ཏུ་བསྟན་ཀྱང་ཕྱོགས་ཙམ་ཞིག་བསྟན་དུ་ཟད་ན། དེ་བཞིན་གཤེགས་པའི་ས་ལྟ་སྨོས་སུ་འང་ག་ལ་ཡོད།
en: In the same way that a minute element of earth from a four-continent world was picked up but that which remains is immeasurable, O jinaputra, in that way even if one were to teach the bodhisattva bhūmi Cloud of Dharma for countless eons, only a fraction of it would be taught, so what need is there to say more concerning the bhūmi of the tathāgatas?

source: ཀྱེ་རྒྱལ་བའི་སྲས་ཁྱོད་ཀྱིས་ཁོང་དུ་ཆུད་པ་དང་། ཡིད་ཆེས་པར་བྱ་ན་དེ་བཞིན་གཤེགས་པ་འདི་བདག་གི་མདུན་ན་དཔང་དུ་བཞུགས་ཏེ།
en: “O jinaputra! I instruct you and make this known to you, in the presence of this tathāgata as a witness.

source: ཀྱེ་རྒྱལ་བའི་སྲས།
en: “O jinaputra!

source: གལ་ཏེ་ཕྱོགས་བཅུའི་ཕྱོགས་རེ་རེའི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་མུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་ཇི་སྙེད་ཅིག་ས་འདི་ལྟ་བུ་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་བུ་རམ་ཤིང་གི་ཚལ་ལམ། སྨྱིག་མའི་ཚལ་ལམ། འོད་མའི་ཚལ་ལམ། ཏིལ་གྱི་ཞིང་ཐིབས་པོ་བཞིན་དུ་ཡོངས་སུ་གང་བར་གྱུར་ཀྱང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་མངོན་པར་བསྒྲུབ་པ་བསྐལ་པ་མུ་མེད་པར་མངོན་པར་བསྒྲུབས་པ་དེ་དག་གིས་ནི་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་སྐད་ཅིག་ཡུད་ཙམ་ཐང་ཅིག་ཏུ་བྱུང་བའི་དེ་བཞིན་གཤེགས་པའི་ཡུལ་གྱི་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོའོ།
en: If bodhisattvas who have attained this kind of bhūmi were to fill the buddha realms in the ten directions as thickly as stands of sugar canes, beds of reeds, stands of bamboo, fields of sesame, or fields of rice, and were to accomplish bodhisattva activity for endless eons, they would not equal even a hundredth of a single instant of a single moment of the wisdom of this tathāgata, of the scope of activity of this tathāgata.

source: །སྟོང་གི་ཆ་དང་། བརྒྱ་སྟོང་གི་ཆ་དང་། བྱེ་བ་བརྒྱའི་ཆ་དང་། བྱེ་བ་བརྒྱ་སྟོང་གི་ཆ་དང་། བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ་བ་ནས་གྲངས་དང་ཆ་དང་བགྲང་བ་དང་དཔེ་དང་རྒྱུ་དང་བསྒྲུན་པ་ཙམ་དུ་ཡང་ཉེ་བར་མི་འགྲོའོ།
en: They would not equal even a thousandth, a hundred thousandth, a ten millionth, a billionth, a ten billionth, a trillionth, or even a quintillionth it. They cannot be correlated to it through numbers, enumeration, comparison, resemblance, or similitude.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དེ་ལྟར་ཡེ་ཤེས་དེ་ལྟ་བུ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པའི་སྐུ་དང་གསུང་དང་ཐུགས་དང་གཉིས་སུ་མེད་པ་ནི། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གྱི་སྟོབས་ཀྱང་ཡོངས་སུ་མི་གཏོང་ལ་སངས་རྒྱས་བལྟ་བ་དང་། མཆོད་པ་དང་། རིམ་གྲོ་ཡང་རབ་ཏུ་བྱེད་དེ།
en: “O jinaputras! In that way the bodhisattva who has that kind of wisdom, who has a body, speech, and mind identical with that of the tathāgatas, does not relinquish the power of the bodhisattva samādhis. He sees the buddhas and makes offerings to them and serves them.

source: བསྐལ་པ་རེ་རེ་ལ་ཡང་དེ་བཞིན་གཤེགས་པ་མཐའ་ཡས་པ་ལ་མཆོད་པ་རྣམ་པ་ཐམས་ཅད་དུ་མངོན་པར་བསྒྲུབས་པའི་མཆོད་པ་རྒྱ་ཆེན་པོའི་རྗེས་སུ་སོང་བས་མཆོད་པ་བྱེད་དོ། །སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་བྱིན་གྱི་རླབས་ཀྱི་སྣང་བ་ཡང་ཡང་དག་པར་འཛིན་ཏོ།
en: In each eon he makes offerings to endless tathāgatas through the accomplishment of every kind of offering. As a result of that vast offering, he receives the radiance of the blessing of those buddha bhagavats.

source: །དེ་ནི་སྔོན་བས་ཀྱང་བསྐལ་པ་དུ་མ་དང་། བསྐལ་པ་བརྒྱ་ཕྲག་དུ་མ་དང་། བསྐལ་པ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་ཁྲག་ཁྲིག་ཕྲག་དུ་མ་དང་། བསྐལ་པ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་དུ་མ་དང་། བསྐལ་པ་ཁྲག་ཁྲིག་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མར་ཆོས་ཀྱི་དབྱིངས་ཡོངས་སུ་དྲིས་པ་ཤིན་ཏུ་བསྟན་པས་མི་འཕྲོགས་པར་གནས་སོ།
en: Even more than before he is unassailable in answering the different kinds of questions within the realm of phenomena for many eons, for many hundreds of eons, many thousands of eons, many hundreds of thousands of eons, many millions of eons, many tens of millions of eons, many billions of eons, many tens of billions of eons, many trillions of eons, and many quintillions of eons. “O jinaputras!

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །འདི་ལྟ་སྟེ་དཔེར་ན། ལྷ་རྫས་ཀྱི་རྒྱན་གྱི་རྣམ་པ་མགར་བས་མ་བརྡུངས་པ་རིན་པོ་ཆེའི་དམ་པས་སྤྲས་པ། ལྷའི་རྒྱལ་པོ་དབང་བསྒྱུར་གྱི་ཡན་ལག་གི་དམ་པ་མགོའམ་མགུལ་དུ་བཏགས་ན། དེ་མ་ཡིན་པའི་ལྷ་དང་མྱིའི་རྒྱན་གྱི་རྣམ་པ་གཞན་གྱིས་མི་འཕྲོགས་ཤིང་མི་ཐུབ་པ་ཡིན།
en: By analogy, a great piece of jewelry inlaid with precious jewels that has been created by a divine smith and is worn by the deva king Vaśavartin upon his head or his throat is beyond comparison with the jewelry of other devas and humans.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ས་བཅུ་པ་ཆོས་ཀྱི་སྤྲིན་འདི་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་ཀྱི་རྒྱུད་དེ་དག་ཀྱང་སེམས་ཅན་ཐམས་ཅད་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་དང་པོ་ཉེ་བར་བཟུང་བ་ཡན་ཅད་བྱང་ཆུབ་སེམས་དཔའི་ས་དགུ་པ་ཐོབ་པའི་བར་གྱི། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་ཀྱང་མི་འཕྲོགས་པ་ཡིན།
en: “O jinaputras! In the same way, the attainment of wisdom of the bodhisattva who has attained the tenth bodhisattva bhūmi, Cloud of Dharma, is beyond comparison with that of all beings, śrāvakas, pratyekabuddhas, and bodhisattvas from the first bhūmi up through the attainment of the ninth bhūmi.

source: བྱང་ཆུབ་སེམས་དཔའི་ས་འདི་ལ་གནས་པའི་ཡེ་ཤེས་སྣང་བ་ནི་སེམས་ཅན་རྣམས་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ལ་གཟུད་པའི་རྒྱུ་ཡིན་ཏེ། དེ་མ་ཡིན་པའི་ཡེ་ཤེས་སྣང་བ་གཞན་གྱིས་མི་འཕྲོགས་སོ།
en: “The illumination from the wisdom of the bodhisattva on this bodhisattva bhūmi brings beings as far as the attainment of omniscient wisdom and is therefore beyond compare with any other wisdom’s illumination. “O jinaputras!

source: །ཀྱེ་རྒྱལ་བའི་སྲས་འདི་ལྟ་སྟེ་དཔེར་ན། ལྷའི་རྒྱལ་པོ་དབང་ཕྱུག་ཆེན་པོའི་འོད་ཀྱིས་ནི་སྐྱེ་བའི་སྐྱེ་མཆེད་ཐམས་ཅད་དུ་འང་ཁྱབ་ལ་སེམས་ཅན་རྣམས་ཀྱི་ལུས་ཀྱང་སིམ་པར་བྱེད་དོ།
en: By analogy, the light of the deva king Maheśvara transcends all states of birth and brings comfort to the bodies of all beings.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ས་བཅུ་པ་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་སྣང་བ་ཡང་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་དང་པོ་ལ་ཉེ་བར་བཟུང་བ་ཡན་ཅད་བྱང་ཆུབ་སེམས་དཔའི་ས་དགུ་པ་ལ་གནས་པའི་བར་གྱི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་ཀྱང་མི་འཕྲོགས་པ་ཡིན། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་བར་གྱི་ཆོས་ཉིད་ལ་ཡང་སེམས་ཅན་རྣམས་རབ་ཏུ་གཞོག་གོ །ཀྱེ་རྒྱལ་བའི་སྲས་བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་དེ་ལྟ་བུ་དང་ལྡན་པ་ལ་ནི།
en: “O jinaputras! In the same way, the radiance of the wisdom of the bodhisattva on this tenth bodhisattva bhūmi, Cloud of Dharma, is beyond compare with that of all śrāvakas, pratyekabuddhas, and the bodhisattvas who have attained the first bhūmi up through the ninth bhūmi, and it brings beings to the nature of omniscient wisdom. “O jinaputras!

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་དུས་གསུམ་གྱི་ཡེ་ཤེས་ཡང་དག་པར་སྟོན་ཏོ།
en: The bodhisattva who has that kind of wisdom is taught the wisdom of the three ways by the buddhas, the bhagavats.

source: །ཆོས་ཀྱི་དབྱིངས་རབ་ཏུ་ཕྱེ་བའི་ཡེ་ཤེས་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་རྒྱས་པར་དགང་བ་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་སྣང་བར་བྱིན་གྱིས་བརླབ་པ་དང་། སེམས་ཅན་ཐམས་ཅད་དང་ཞིང་གི་ཆོས་ཡོངས་སུ་ཤེས་པར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དང་། སྤྱོད་པ་ལ་འཇུག་པའི་ཡེ་ཤེས་ནས་མདོར་བསྡུ་ན། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཐོབ་པར་བྱ་བའི་བར་དུ་ཡང་དག་པར་བསྟན་ཏོ།
en: He is taught the wisdom of the different aspects of the realm of phenomena, that which pervades all worlds, that which has the blessing of illuminating all worlds, that which knows all beings, realms, and phenomena, that which knows the process of the activity of the minds of all beings, that which knows the time for the ripening of all beings, that which never abandons guidance, that which is skilled in the wisdom that differentiates all the various kinds of phenomena, and so on, up to immeasurable omniscient wisdom.

source: །དེའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བཅུ་ལས་ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཤས་ཆེ་བ་ཡིན་ཏེ།
en: “From among the ten perfections, he primarily practices the perfection of knowledge.

source: ཀྱེ་རྒྱལ་བའི་སྲས་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཆོས་ཀྱི་སྤྲིན་ཅེས་བྱ་བ། བྱང་ཆུབ་སེམས་དཔའི་ས་བཅུ་པ་མདོར་བསྟན་པའོ།
en: “O jinaputras! That in brief is the bodhisattva bhūmi Cloud of Dharma, the tenth bodhisattva bhūmi.

source: །རྒྱ་ཆེར་ནི་བསྐལ་པ་གྲངས་མྱེད་པ་མུ་མྱེད་པས་བསྟན་པའི་མཐར་ཐུག་པར་ཤེས་པར་བྱའོ།
en: It could only be known in detail through being taught for endless countless eons.

source: །དེ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཕལ་ཆེར་ལྷའི་རྒྱལ་པོ་དབང་ཕྱུག་ཆེན་པོར་འགྱུར་ཏེ།
en: Most of the bodhisattvas on that bhūmi become the deva king Maheśvara.

source: སེམས་ཅན་རྣམས་ལ་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྟན་པ་ལ་མཁས་ཤིང་མཐུ་ཡོད་པ་ཡིན། ཆོས་ཀྱི་དབྱིངས་རྣམ་པར་ཕྱེ་བ་ཡོངས་སུ་དྲིས་པ་བསྟན་པས་མི་འཕྲོགས་པ་ཡིན། སྦྱིན་པ་འམ། ངག་སྙན་པ་འམ། དོན་བསྒྲུབ་པ་འམ།
en: He is skilled and powerful in teaching the perfections to beings, śrāvakas, pratyekabuddhas, and bodhisattvas, and is beyond unassailable in his teaching that answers questions on the different aspects of the realm of phenomena.

source: བླ་ན་མེད་པར་འགྱུར། འདྲེན་པར་འགྱུར། ཡོངས་སུ་འདྲེན་པར་འགྱུར་བ་ནས། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ལ་རྟེན་པའི་བར་དུ་འགྱུར་སྙམ་སྟེ། སངས་རྒྱས་ཡིད་ལ་བྱ་བ་དང་། ཆོས་ཡིད་ལ་བྱ་བ་དང་། དགེ་འདུན་ཡིད་ལ་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཡིད་ལ་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡིད་ལ་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་ཡིད་ལ་བྱ་བ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡིད་ལ་བྱ་བ་དང་། སྟོབས་ཡིད་ལ་བྱ་བ་དང་། མི་འཇིགས་པ་ཡིད་ལ་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ཡིད་ལ་བྱ་བ་ནས་རྣམ་པའི་མཆོག་ཐམས་ཅད་དང་ལྡན་པའི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་བར་དུ་ཡིད་ལ་བྱ་བ་དང་མི་འབྲལ་བ་ཡིན་ཏེ།
en: His mind is always focused on the Buddha, focused on the Dharma, focused on the Saṅgha, focused on the bodhisattvas, focused on bodhisattva conduct, focused on the bodhisattva bhūmis, focused on the perfections, focused on the strengths, focused on the confidences, focused on the unique qualities of buddhahood, and so on, up until being focused on and inseparable from the omniscient wisdom endowed with the supreme aspects.

source: དེ་འདོད་ན་སྐད་ཅིག་ཡུད་ཙམ་ཐང་ཅིག་ཏུ་ཏིང་ངེ་འཛིན་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་རབ་ཏུ་འཐོབ་ཅིང་དེ་དག་ལ་སྙོམས་པར་འཇུག་པ་དང་། སངས་རྒྱས་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་མཐོང་བ་དང་། དེ་དག་གི་བྱིན་གྱི་རླབས་ཀྱང་ཡང་དག་པར་ཤེས་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་སྐྱོད་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ནས་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དུ་འགྲོ་བ་དང་། འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་སྣང་བར་བྱ་བ་དང་། སེམས་ཅན་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། བསྐལ་པ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དུ་གནས་པར་བྱ་བ་དང་། སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའི་བསྐལ་པ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ལ་རབ་ཏུ་འཇུག་པ་དང་། ཆོས་ཀྱི་སྒོ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་རྣམ་པར་དབྱེ་བར་བྱ་བ་དང་། ལུས་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཡོངས་སུ་བསྟན་པ་དང་། ལུས་རེ་རེ་ལ་ཡང་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཡང་དག་པར་བསྟན་པའི་བརྩོན་འགྲུས་ཀྱི་རྣམ་པ་དེ་ལྟ་བུ་རྩོམ་མོ། །དེ་ཡན་ཅད་བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་གྱི་མཐུ་ཅན་རྣམས་སྨོན་ལམ་གྱི་ཁྱད་པར་ཀྱིས་རྣམ་པར་འཕྲུལ་ཏེ། དེ་དག་གི་ལུས་སམ་འོད་དམ། རྫུ་འཕྲུལ་ལམ། མིག་གམ་སྤྱོད་ཡུལ་ལམ།
en: “If he wishes to, he can apply himself in such a way that in just one instant he attains as many samādhis as there are atoms in countless quintillions of buddha realms, sees as many buddhas as there are atoms in countless quintillions of buddha realms and knows their blessings, causes as many billion-world universes to shake as there are atoms in countless quintillions of buddha realms, goes to as many buddhas as there are atoms in countless quintillions of buddha realms, illuminates as many universes as there are atoms in countless quintillions of buddha realms, ripens as many beings as there are atoms in countless quintillions of buddha realms, remains for as many eons as there are atoms in countless quintillions of buddha realms, comprehends as many previous and future eons as there are atoms in countless quintillions of buddha realms, opens as many Dharma doors as there are atoms in countless quintillions of buddha realms, manifests as many bodies as there are atoms in countless quintillions of buddha realms, and manifests each body having a retinue of as many bodhisattvas as there are atoms in countless quintillions of buddha realms. That is the kind of diligence he undertakes.

source: དབྱངས་སམ་སྤྱོད་པ་འམ། རྒྱན་ཏམ། བྱིན་གྱི་རླབས་སམ། མོས་པ་འམ། མངོན་པར་འདུ་བྱེད་པ་དག་ཀྱང་བསྐལ་པ་དུ་མ་དང་། བསྐལ་པ་བརྒྱ་ཕྲག་དུ་མ་དང་། བསྐལ་པ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་བརྒྱ་སྟོང་ཕྲག་དུ་མའི་བར་གྱིས་ཀྱང་བགྲང་བར་དཀའོ།
en: “From this time onward the bodhisattvas who have the power of prayer through particular prayers manifest bodies, light, miracles, sights, activities, voices, conduct, displays, blessings, transformations, and manifestations for many eons, for many hundreds of eons, many thousands of eons, many hundreds of thousands of eons, and so on, until many quintillions of eons, which are difficult to enumerate.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་བྱང་ཆུབ་སེམས་དཔའི་ས་བཅུ་པོ་དེ་དག་ནི་རིམ་གྱིས་མངོན་དུ་གཞོལ་བས།
en: “O jinaputras! That is the brief teaching on the ten bodhisattva bhūmis. If I were to teach it in detail, the teaching would not be concluded even after countless eons. They have been taught, are being taught, and will be taught by the buddhas, the bhagavats of the past, the present, and the future. “O jinaputras!

source: ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ལ་རྣམ་པ་ཐམས་ཅད་དུ་རྗེས་སུ་སོང་བར་བལྟའོ།
en: These ten bodhisattva bhūmis successively approach the attainment of complete omniscient wisdom that they are headed for. “O jinaputras!

source: །ཀྱེ་རྒྱལ་བའི་སྲས་འདི་ལྟ་སྟེ་དཔེར་ན། མཚོ་ཆེན་པོ་མ་དྲོས་པ་ལས་བྱུང་བའི་འབབ་ཆུ་ནི་ཆུ་ཀླུང་ཆེན་པོའི་རྒྱུད་ཀྱི་སྒོ་བཞིས་འཛམ་བུའི་གླིང་ཡོངས་སུ་ངོམས་པར་བྱས་ནས་མི་ཟད་པར་བྱས་ཏེ།
en: By analogy, the four great rivers, which are four flows of water that have great Lake Anavatapta as their source, bring refreshment to Jambudvīpa.

source: གོང་དུ་རྣམ་པར་འཕེལ་བ་དང་། རྒྱ་མཚོ་ཆེན་པོའི་བར་དུ་ཞེན་པར་འགྱུར་ཏེ།
en: They never cease but grow larger and benefit beings until they enter the great ocean.

source: ཆུ་དེ་ནི་ཐོག་མ་ནས་ཀྱང་རྒྱ་མཚོ་ཆེན་པོ་ལ་མངོན་པར་གཞོལ་བ་ཡིན་ཏེ།
en: That water was from the beginning headed toward the great ocean. “O jinaputras!

source: ཀྱེ་རྒྱལ་བའི་སྲས་དེ་བཞིན་དུ་བྱང་ཆུབ་ཀྱི་སེམས་ལས་བྱུང་བའི་དགེ་བའི་རྩ་བའི་ཆུ་འབབ་པ་ཡང་སྨོན་ལམ་ཆེན་པོའི་ཆུ་ཀླུང་གི་རྒྱུན་གྱི་སྒོ་ནས་བསྡུ་བའི་དངོས་པོ་བཞིས་སེམས་ཅན་གྱི་ཁམས་ངོམས་པར་བྱས་ཏེ། མི་ཟད་པར་བྱས་ནས་གོང་དུ་རྣམ་པར་འཕེལ་བ་དང་། རྣམ་པ་ཐམས་ཅད་དུ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་བར་གྱི་རྒྱ་མཚོ་ཆེན་པོ་ལ་ཞེན་པར་འགྱུར་ཏེ། དགེ་བའི་རྩ་བའི་ཆུ་དེ་ནི་ཐོག་མ་ནས་ཀྱང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྒྱ་མཚོ་ཆེན་པོ་ལ་མངོན་པར་གཞོལ་བ་ཡིན།
en: In that same way the flow of the water of the roots of goodness that has as its origin the great lake of bodhicitta forms the four great rivers of aspiration that, through the four methods of attracting beings, bring relief to the realm of beings, and that do not cease but grow greater, bringing benefit to countless beings until they enter the great ocean of omniscient wisdom, and that water of the roots of goodness is from the beginning headed toward the great ocean of omniscience.

source: བྱང་ཆུབ་སེམས་དཔའི་ས་བཅུ་པོ་དེ་དག་ནི་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཀྱི་གཞི་ལས་ཡོད་པར་འགྱུར་ཏེ།
en: Those ten bodhisattva bhūmis are known to be dependent upon the wisdom of the buddhas.

source: ས་ཆེན་པོའི་གཞི་ལས་རིའི་རྒྱལ་པོ་ཆེན་པོ་བཅུ་ཡོད་པར་གྱུར་པ་འདི་ལྟ་སྟེ།
en: By analogy, the ten great precious mountains are known to be dependent upon the great earth.
